Revit 2027 API
Camera Properties
The Camera type exposes the following members.
Properties
Name | Description
EyePosition |  Camera's position in the world
FarDistance |  Distance to far clipping plane
HorizontalExtent |  Horizontal extent of the camera's view, measured at target distance.
HorizontalOffset |  Horizontal offset of the camera's view center from target, measured at target distance.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NearDistance |  Distance to near clipping plane
ProjectionMethod |  Projection method
TargetDistance |  Distance from camera to its target
UpDirection |  Up direction of the camera
VerticalExtent |  Vertical extent of the camera's view, measured at target distance.
VerticalOffset |  Vertical offset of the camera's view center from target, measured at target distance.
ViewDirection |  Direction that the camera is facing
Top
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace